#!/usr/bin/env bash

# Вывести дату в формате:
#   13 октября 2023 года, Пятница
D=$(date '+%d' -d "$@")
M=$(date '+%m' -d "$@")
Y=$(date '+%Y' -d "$@")
W=$(date '+%u' -d "$@")

D=$((10#$D))
M=$((10#$M))

case $M in
  01) mon="января";;   02) mon="февраля";;  03) mon="марта";;
  04) mon="апреля";;   05) mon="мая";;      06) mon="июня";;
  07) mon="июля";;     08) mon="августа";;  09) mon="сентября";;
  10) mon="октября";;  11) mon="ноября";;   12) mon="декабря";;
esac

case $W in
  1) day="Понедельник";; 2) day="Вторник";;  3) day="Среда";;
  4) day="Четверг";;     5) day="Пятница";;  6) day="Суббота";;
  7) day="Воскресенье";;
esac

echo "$D $mon $Y года, $day"
