#!/usr/bin/env bash

# Вывести дату в формате:
#   13 октября 2023 года, Пятница

D=$(date '+%-d' -d "$@")
M=$(date '+%m' -d "$@")
Y=$(date '+%Y' -d "$@")
W=$(date '+%u' -d "$@")

M=$((10#$M))
W=$((10#$W))

case $M in
  1) mon="января";;   2) mon="февраля";; 3) mon="марта";;
  4) mon="апреля";;   5) mon="мая";;     6) mon="июня";;
  7) mon="июля";;     8) mon="августа";; 9) mon="сентября";;
  10) mon="октября";; 11) mon="ноября";; 12) mon="декабря";;
esac

case $W in
  1) day="Понедельник";; 2) day="Вторник";; 3) day="Среда";;
  4) day="Четверг";;     5) day="Пятница";; 6) day="Суббота";;
  7) day="Воскресенье";;
esac

echo "$D $mon $Y года, $day"
